# Pandas Dataframe 
1. Crear data frames
2. Seleccionar elementos
3. Ordenar columnas

## Punto 1

In [1]:
# importar pandas 
import pandas as pd

In [2]:
# datos de RRSS 2020
fbk = ['Facebook', 2449, True, 2006]
twt = ['Twitter', 339, False, 2006]
ig = ['Instragram', 1000, True, 2010]
yt = ['YouTube', 2000, False, 2005]
lkn = ['LinkedIn', 663, False, 2003]
wsp = ['WhatsApp', 1600, True, 2009]

In [3]:
lista_rrss = [fbk, twt, ig, yt, lkn, wsp]

In [4]:
# crear dataframe a partir de las listas
df_rrss = pd.DataFrame(lista_rrss,columns = ['Nombre', 'Cantidad', 'ES_FBK', 'Año'])
df_rrss

       Nombre  Cantidad  ES_FBK   Año
0    Facebook      2449    True  2006
1     Twitter       339   False  2006
2  Instragram      1000    True  2010
3     YouTube      2000   False  2005
4    LinkedIn       663   False  2003
5    WhatsApp      1600    True  2009

In [6]:
# crear dataframe vacio
df_vacio = pd.DataFrame(columns = ['Nombre', 'Cantidad', 'ES_FBK', 'Año'])
df_vacio

Empty DataFrame
Columns: [Nombre, Cantidad, ES_FBK, Año]
Index: []

In [15]:
# Asignar datos a Dataframe
df_vacio.loc[len(df_vacio)] = ['Facebook', 2449, True, 2006]
df_vacio

     Nombre  Cantidad  ES_FBK   Año
0  Facebook      2449    True  2006

In [ ]:
# Borrar fila
# df_vacio = df_vacio.drop(index=0)
# df_vacio.drop(index=0, inplace=True)

#borrar varias filas
# df_vacio = df_vacio.drop(index=[0, 2, 4])

#Reindexar
# df_vacio.reset_index(drop=True, inplace=True)

Empty DataFrame
Columns: [Nombre, Cantidad, ES_FBK, Año]
Index: []

In [ ]:
# Borrar x Condicion 
# Elimina todas las filas donde ES_FBK es False
# df_vacio = df_vacio[df_vacio['ES_FBK'] == True]

## Punto 2

In [16]:
#Seleccionar elementos .loc vs .iloc
df_rrss

       Nombre  Cantidad  ES_FBK   Año
0    Facebook      2449    True  2006
1     Twitter       339   False  2006
2  Instragram      1000    True  2010
3     YouTube      2000   False  2005
4    LinkedIn       663   False  2003
5    WhatsApp      1600    True  2009

In [17]:
# seleccionar un elemento por etiquetas
df_rrss.loc[1,'Nombre']

'Twitter'

In [18]:
# seleccionar un elemento por número
df_rrss.iloc[1,0]

'Twitter'

In [19]:
# seleccionar por columnas 
df_rrss['Nombre']

0      Facebook
1       Twitter
2    Instragram
3       YouTube
4      LinkedIn
5      WhatsApp
Name: Nombre, dtype: object

In [20]:
# seleccionar por filas 
df_rrss.iloc[4]

Nombre      LinkedIn
Cantidad         663
ES_FBK         False
Año             2003
Name: 4, dtype: object

In [21]:
# seleccionar por condicion booleana
df_rrss['Cantidad']>1500

0     True
1    False
2    False
3     True
4    False
5     True
Name: Cantidad, dtype: bool

In [22]:
df_rrss[df_rrss['Cantidad']>1500]

     Nombre  Cantidad  ES_FBK   Año
0  Facebook      2449    True  2006
3   YouTube      2000   False  2005
5  WhatsApp      1600    True  2009

## Punto 3

In [ ]:
# Como ordenar columnas

In [23]:
# ordenar modo ascendente: de menor a mayor
df_rrss.sort_values('Nombre', ascending=True)

       Nombre  Cantidad  ES_FBK   Año
0    Facebook      2449    True  2006
2  Instragram      1000    True  2010
4    LinkedIn       663   False  2003
1     Twitter       339   False  2006
5    WhatsApp      1600    True  2009
3     YouTube      2000   False  2005

In [24]:
# ordenar modo descendente: de mayor a menor
df_rrss.sort_values('Cantidad', ascending=False)

       Nombre  Cantidad  ES_FBK   Año
0    Facebook      2449    True  2006
3     YouTube      2000   False  2005
5    WhatsApp      1600    True  2009
2  Instragram      1000    True  2010
4    LinkedIn       663   False  2003
1     Twitter       339   False  2006

In [ ]:
# Ordenar por dos valores

In [25]:
# Ordenar por dos columnas
df_rrss.sort_values(['Año','Cantidad'], ascending=[True, False])

       Nombre  Cantidad  ES_FBK   Año
4    LinkedIn       663   False  2003
3     YouTube      2000   False  2005
0    Facebook      2449    True  2006
1     Twitter       339   False  2006
5    WhatsApp      1600    True  2009
2  Instragram      1000    True  2010